// Autor: Marcelo Rodrigues
// Busca por comandos do CMD sendo executados com privilégios SYSTEM, o que pode indicar elevação de privilégios. 
// Ignora execuções do cmd.exe feitas por processos que são considerados confiáveis.
DeviceProcessEvents
| order by Timestamp desc
| where AccountName == "system" or AccountName == "sistema" 
| where FileName == "cmd.exe"
| where not(ProcessCommandLine contains "AtivaOfficex64.bat")
| where InitiatingProcessFileName != @"core.exe"
| where InitiatingProcessFileName != @"zabbix_agentd.exe"
| where InitiatingProcessVersionInfoCompanyName != @"Intel Corporation"
| where InitiatingProcessVersionInfoCompanyName != @"Dell Inc."
| where InitiatingProcessVersionInfoCompanyName != @"Microsoft Corporation"
| where InitiatingProcessVersionInfoCompanyName != @"Google LLC"
| project Timestamp, DeviceName, FileName, InitiatingProcessAccountName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessVersionInfoCompanyName, InitiatingProcessSHA256
